cask_args appdir: '/Applications'

tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "sanemat/font"
brew "go"
brew "goenv"
brew "awscli"
brew "harfbuzz"
brew "ffmpeg"
brew "fontforge"
brew "iceberg"
brew "git"
brew "jq"
brew "docker"
brew "docker-machine"
brew "mkcert"
brew "postgresql"
brew "wget"
brew "tree"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "sanemat/font/ricty"
brew "gh"
cask "soundflower"
cask "bettertouchtool"
cask "google-chrome"
cask "zoom"
cask "flux"
cask "iterm2"
cask "vlc"
cask "slack"
cask "visual-studio-code"
cask "karabiner-elements"
cask "messenger"
cask "rectangle"
cask "tableplus"
cask "notion"
cask "contexts"
cask "the-unarchiver"
cask "cleanmymac"
cask "app-cleaner"
cask "google-japanese-ime"
cask "deepl"
cask "docker"
cask "alfred"
cask "google-cloud-sdk"
cask "michaelvillar-timer"
cask "ngrok"
cask "onyx"
cask "thunder"
cask "expressvpn"
cask "grammarly-desktop"
cask "4k-video-downloader"

mas "Display menu", id: 549083868
mas "Amphetamine", id: 937984704
mas "Reeder 5", id: 1529448980
mas "Spark", id: 1176895641
mas "LINE", id: 539883307
